infra/benchmarks/results/20260818-114403/00_smoke_c1_i32_o16/client.log
/usr/local/lib/python3.12/dist-packages/transformers/utils/hub.py:105: FutureWarning: Using `TRANSFORMERS_CACHE` is deprecated and will be removed in v5 of Transformers. Use `HF_HOME` instead.
  warnings.warn(
INFO 08-18 11:44:18 [__init__.py:243] No platform detected, vLLM is running on UnspecifiedPlatform
Namespace(backend='openai-chat', base_url='http://10.1.1.238:50380', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', dataset_name='random', dataset_path=None, max_concurrency=1, model='/home/u001013/.cache/llm-serving/huggingface/hub/models--Qwen--Qwen2.5-72B-Instruct/snapshots/495f39366efef23836d0cfae4fbe635880d2be31', tokenizer='/home/u001013/.cache/llm-serving/huggingface/hub/models--Qwen--Qwen2.5-72B-Instruct/snapshots/495f39366efef23836d0cfae4fbe635880d2be31', use_beam_search=False, num_prompts=4, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['case=00_smoke_c1_i32_o16', 'input_len=32', 'output_len=16', 'serving_run_id=20260818-111259-1292391', 'tp=4', 'pp=2', 'gpu=V100-SXM2-32GB'], result_dir='/home/u001013/llm_serving/benchmarks/results/20260818-114403/00_smoke_c1_i32_o16', result_filename='client.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=32, random_output_len=16, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='qwen2.5-72b', lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 4/4 [00:04<00:00,  1.17s/it]
============ Serving Benchmark Result ============
Successful requests:                     4         
Benchmark duration (s):                  4.70      
Total input tokens:                      128       
Total generated tokens:                  64        
Request throughput (req/s):              0.85      
Output token throughput (tok/s):         13.63     
Total Token throughput (tok/s):          40.88     
---------------Time to First Token----------------
Mean TTFT (ms):                          162.06    
Median TTFT (ms):                        162.48    
P50 TTFT (ms):                           162.48    
P90 TTFT (ms):                           175.09    
P95 TTFT (ms):                           176.93    
P99 TTFT (ms):                           178.40    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          67.44     
Median TPOT (ms):                        67.41     
P50 TPOT (ms):                           67.41     
P90 TPOT (ms):                           67.60     
P95 TPOT (ms):                           67.63     
P99 TPOT (ms):                           67.65     
---------------Inter-token Latency----------------
Mean ITL (ms):                           63.22     
Median ITL (ms):                         67.33     
P50 ITL (ms):                            67.33     
P90 ITL (ms):                            67.82     
P95 ITL (ms):                            68.08     
P99 ITL (ms):                            68.69     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          1173.67   
Median E2EL (ms):                        1172.27   
P50 E2EL (ms):                           1172.27   
P90 E2EL (ms):                           1188.55   
P95 E2EL (ms):                           1191.06   
P99 E2EL (ms):                           1193.07   
==================================================